<a href="https://colab.research.google.com/github/fereshtehdehkhoda/Example-31-MVS-pearson-corr/blob/main/S8Soale5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#در دیتافریم زیر، مقادیر گمشده را با میانگین هر ستون جایگزین و ضریب همبستگی پیرسون بین x و y را برآورد کنید.

In [ ]:
import pandas as pd
import pandas as np

In [ ]:
data=pd.read_csv("s8 soale 5.csv")

In [ ]:
data

      x     y
0  12.1  0.20
1  14.0  0.41
2   NaN  0.32
3  10.0  0.19
4   2.0  0.05
5  23.0  0.67
6   NaN  0.11
7  15.0  0.32
8   7.0   NaN
9  11.0  0.23

In [ ]:
data["x"]=data["x"].fillna(data["x"].mean())
data["y"]=data["y"].fillna(data["y"].mean())

In [ ]:
data

         x         y
0  12.1000  0.200000
1  14.0000  0.410000
2  11.7625  0.320000
3  10.0000  0.190000
4   2.0000  0.050000
5  23.0000  0.670000
6  11.7625  0.110000
7  15.0000  0.320000
8   7.0000  0.277778
9  11.0000  0.230000

In [ ]:
peareson_corr=round(data[["x","y"]].corr(method='pearson'),2)
peareson_corr

      x     y
x  1.00  0.86
y  0.86  1.00